
# Домашнее задание к работе 7

## Условие задачи

Написать программу, которая для заданной стоимости покупки в
копейках выводить текстовое сообщение, отображающие значение в рублях и
копейках с правильным склонением слова «копейка».

## 1. Алгоритм и блок-схема

### Алгоритм

##### 1 Начало

2 Объявить переменные:

    cet — исходная сумма в копейках (целое число)
    
    rub — количество полных рублей (целое число)
    
    kop — оставшиеся копейки после выделения рублей (целое число)
    
    cklon — указатель на строку для правильного склонения слова "копейка"

3 Ввести значение cet:

    Вывести приглашение "введите стоимость в копейках: "
    Считать целое число в переменную cet
4 Вычислить рубли и копейки:

    rub = cet / 100 (целочисленное деление — количество полных рублей)
    kop = cet % 100 (остаток от деления — оставшиеся копейки)

5 Определить правильное склонение слова "копейка" для числа kop:

    Если kop равно 11, 12, 13 или 14:
    cklon = "копеек"
    Иначе:
    Взять последнюю цифру kop % 10
    Если последняя цифра равна 1:
    cklon = "копейка"
    Если последняя цифра равна 2, 3 или 4:
    cklon = "копейки"
    В остальных случаях:
    cklon = "копеек"

6 Вывести результат:

  Напечатать рубли:
  printf("%d рубл. ", rub)
  Напечатать копейки со словом в правильной форме: 
  printf("%d %s", kop, cklon)

##### 7 Конец


### Блок-схема




## 2. Реализация программы

    #include <stdio.h>
    #include <locale.h>
    
    int main()
    {
        setlocale(LC_ALL, "RUS");
        int n;
        double sum = 0.0;
    
        printf("Введите значение n: ");
        scanf("%d", &n);
    
        for (int i = 1; i <= n; i++)
        {
            double del = (2 * i + 1);
            double term = 1.0 / (del * del);
            sum += term;
        }
    
        printf("Сумма ряда для n = %d: %.6f\n", n, sum);
    
        return 0;
    }

## 3. Результаты работы программы

    Введите значение n: 5
    Сумма ряда для n = 5: 0,192129
    
    C:\Users\Олег\source\repos\Project5\x64\Debug\Project5.exe (процесс 13132) завершил работу с кодом 0 (0x0).
    Нажмите любую клавишу, чтобы закрыть это окно:

## 4. Информация о разработчике

Крылов Олег бИЦ-252



